Documents/Запрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Запрос</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыЗапроса</xr:Item>
				<xr:Item>InformationRegister.ПараметрыЗапросаЛинейный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентствоНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОтделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВозрастнаяГруппа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравообладателей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравообладателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеющиесяНаличныеСредства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПриходаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПриходаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСекций_Несколько</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСекций_Одна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПервыйЭтаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоследнийЭтаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемСредствНаПокупку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оптовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проживает</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Расположение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаИсточниковПриходаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасшифровкаИсточниковПриходаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныСтатусовЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставСемьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоставСемьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СрокиСдачиОбъектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДомаМонолит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДомаПанель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеРасшифровкиИсточникаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УточнениеРасшифровкиИсточниковПриходаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтажДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтажОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФакторыВыбораОН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФакторВыбора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФакторыВыбораОН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конкуренты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конкурент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Конкуренты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтопФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтопФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФакторыВыбораОН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойТелефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брокер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВИП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбъектовСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корпус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КорпусаОбъектовСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расположения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Расположение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Мотивации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мотивация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелиПокупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦельПокупки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦельПокупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеЗапросовЗвонкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеЗапросовЗвонкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Звонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтадииЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтадииЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Звонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переговоры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Запрос/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьПометкуУдаленияУВложенийЗапросов(Ссылка, ПометкаУдаления) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяОбъектаМетаданных = "ЗапросПрисоединенныеФайлы";

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Редактирует КАК Редактирует	
	|ИЗ
	|	Справочник." + ИмяОбъектаМетаданных + " КАК Файлы
	|ГДЕ
	|	Файлы.ПометкаУдаления <> &ПометкаУдаления
	|	И Файлы.ВладелецФайла = &ВладелецФайла
	|");
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПометкаУдаления И ЗначениеЗаполнено(Выборка.Редактирует) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"" не может быть удален,
				|т.к. содержит присоединенный файл ""%2"",
				|занятый для редактирования.'"),
				Строка(Ссылка),
				Строка(Выборка.Ссылка));
		КонецЕсли;		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Объект.Заблокировать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заблокировать объект " + Объект + "! " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		Объект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//<792882>, Басаргин (16.03.2018) {
	Если Стадия = ПредопределенноеЗначение("Перечисление.СтадииЗапроса.Сделка") Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РасшифровкаСтатуса"));
	КонецЕсли;		
	//<792882> }
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//<853885>, Басаргин (06.08.2018) {
	КлиентыТЧ = Новый Массив;
	СтрокиНаУдаление = Новый Массив;
	Участники.Свернуть("Клиент, Основной", "ОсновнойТелефон");
	Для каждого СтрокаУчастник Из Участники Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаУчастник.ОсновнойТелефон) ИЛИ СтрокаУчастник.ОсновнойТелефон = "0" Тогда
			СтрокаУчастник.ОсновнойТелефон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУчастник.Клиент, "ОсновнойТелефон");
		КонецЕсли;
		Если НЕ КлиентыТЧ.Найти(СтрокаУчастник.Клиент) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = Участники.НайтиСтроки(Новый Структура("Клиент", СтрокаУчастник.Клиент));
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НЕ НайденнаяСтрока.Основной И СтрокиНаУдаление.Количество() < НайденныеСтроки.Количество() Тогда
					СтрокиНаУдаление.Добавить(НайденнаяСтрока);	
					КлиентыТЧ.Добавить(Клиент);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;			
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиНаУдаление Цикл
		Участники.Удалить(Строка);
	КонецЦикла;	
	//<853885> }
		
	//<792882>, Басаргин (16.03.2018) {
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Стадия") = ПредопределенноеЗначение("Перечисление.СтадииЗапроса.Сделка") И Стадия = ПредопределенноеЗначение("Перечисление.СтадииЗапроса.Сделка") Тогда
		Статус = Перечисления.СтатусыЗапроса.Завершено;
		РасшифровкаСтатуса = Справочники.ПричиныСтатусовЗапроса.ПустаяСсылка();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СистемноеПроведение") И ДополнительныеСвойства.СистемноеПроведение Тогда
		Возврат;	
	КонецЕсли;
	//<792882> }
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Ролевая модель для менеджера филиала и менеджера ГПТ
	Если Пользователи.РолиДоступны("МенеджерФилиала") 
			И Стадия = Перечисления.СтадииЗапроса.Звонок Тогда
		Стадия = Перечисления.СтадииЗапроса.Переговоры;	
	КонецЕсли;	
	
	ОбработатьДублированиеЗначенийВТабличныхЧастях();
	
	УстановитьПометкуУдаленияУВложенийЗапросов(Ссылка, ПометкаУдаления);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//<831583>, Басаргин (13.06.2018) {	
	ВыполнитьДвиженияПоРегиструУчастникиЗапроса(ПометкаУдаления);
	//<831583> }
	
	//<792882>, Басаргин (16.03.2018) {
	Если ДополнительныеСвойства.Свойство("СистемноеПроведение") Тогда
		ДополнительныеСвойства.Удалить("СистемноеПроведение");
		ОбменДанными.Загрузка = Истина;
	КонецЕсли;
	//<792882> }	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Телефония_ID_Звонка") Тогда
		
		НаборЗаписей = РегистрыСведений.СоответствиеЗапросовЗвонкам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Запрос.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Отбор.ID_Звонка.Установить(ЭтотОбъект.ДополнительныеСвойства.Телефония_ID_Звонка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			ЗаписьНабора = НаборЗаписей[0];		
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();				
		КонецЕсли;
		
		ЗаписьНабора.ID_Звонка 	= ЭтотОбъект.ДополнительныеСвойства.Телефония_ID_Звонка;
		ЗаписьНабора.Запрос 	= ЭтотОбъект.Ссылка;
		ЗаписьНабора.ДатаСвязи 	= ТекущаяДата();
		
		НаборЗаписей.Записать();
		
		УправлениеТелефониейСервер.УстановитьСтатусЗвонка(ЭтотОбъект.ДополнительныеСвойства.Телефония_ID_Звонка, Справочники.СтатусыЗвонков.ПредпродажноеОбслуживание);
				
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Ролевая модель для менеджера филиала и менеджера ГПТ
	Если Пользователи.РолиДоступны("МенеджерФилиала") Тогда
		Стадия = Перечисления.СтадииЗапроса.Переговоры;
	Иначе
		Стадия = Перечисления.СтадииЗапроса.Звонок;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВыполнитьДвиженияПоРегиструПараметрыЗапроса();
	ВыполнитьДвиженияПоРегиструПараметрыЗапросаЛинейно();
	ВыполнитьДвиженияПоИсторииСтадийСтатусов();
	//ВыполнитьДвиженияПоРегиструУчастникиЗапроса();
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//НаборЗаписей = РегистрыСведений.УчастникиЗапроса.СоздатьНаборЗаписей();			
	//НаборЗаписей.Отбор.Запрос.Установить(Ссылка);
	//НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДвиженияПоРегиструУчастникиЗапроса(ПометкаУдаления = Ложь)
	
	НаборЗаписей = РегистрыСведений.УчастникиЗапроса.СоздатьНаборЗаписей();			
	НаборЗаписей.Отбор.Запрос.Установить(Ссылка);
	НаборЗаписей.Очистить();
	
	Если НЕ ПометкаУдаления Тогда
		
		ВыгрузкаУчастники = Участники.Выгрузить(); //РезультатЗапроса.Выгрузить();//
		ВыгрузкаУчастники.Свернуть("Клиент", "Брокер, Основной, ОсновнойТелефон");
		
		Для каждого СтрокаТЧ Из ВыгрузкаУчастники Цикл	
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Запрос = Ссылка;		
			НоваяЗапись.Клиент = СтрокаТЧ.Клиент;
			НоваяЗапись.Телефон = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(СтрокаТЧ.ОсновнойТелефон);
			НоваяЗапись.Основной = СтрокаТЧ.Основной;
		КонецЦикла;		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегиструПараметрыЗапросаЛинейно()
	
	Движение = Движения.ПараметрыЗапросаЛинейный.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	Движение.Запрос = Ссылка;
	Движения.ПараметрыЗапросаЛинейный.Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегиструПараметрыЗапроса()
	
	ТаблицаПоПараметрамЗапроса = Движения.ПараметрыЗапроса.ВыгрузитьКолонки();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыЗапроса.ИмяПредопределенныхДанных КАК ИмяРеквизита,
	|	ПараметрыЗапроса.ИспользоватьВсегда КАК ИспользоватьВсегда,
	|	ПараметрыЗапроса.Ссылка КАК Параметр
	|ИЗ
	|	Справочник.ПараметрыЗапроса КАК ПараметрыЗапроса
	|ГДЕ
	|	НЕ ПараметрыЗапроса.ПометкаУдаления";
	РезультатЗапроса 	= Запрос.Выполнить();
	ВыборкаРеквизитов 	= РезультатЗапроса.Выгрузить();	
	
	РеквизитыДокумента 		= ЭтотОбъект.Метаданные().Реквизиты;
	ТабличныеЧастиДокумента = ЭтотОбъект.Метаданные().ТабличныеЧасти;
	
	Для Каждого РеквизитДокумента Из РеквизитыДокумента Цикл			
		СформироватьЗаписьПоПараметрам(РеквизитДокумента, ТаблицаПоПараметрамЗапроса, ВыборкаРеквизитов);
	КонецЦикла;	
	
	Для Каждого ТЧДокумента Из ТабличныеЧастиДокумента Цикл	
		СформироватьЗаписиПоТабличнымЧастям(ТЧДокумента, ТаблицаПоПараметрамЗапроса, ВыборкаРеквизитов);
	КонецЦикла;	
	
	Если ТаблицаПоПараметрамЗапроса.Количество() > 0 Тогда
		
		ТаблицаПоПараметрамЗапроса.ЗаполнитьЗначения(ЭтотОбъект.Дата, "Период");
		Движения.ПараметрыЗапроса.Загрузить(ТаблицаПоПараметрамЗапроса);
		Движения.ПараметрыЗапроса.Записывать = Истина;		
	
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьЗаписьПоПараметрам(РеквизитДокумента, ТаблицаПоПараметрамЗапроса, ВыборкаРеквизитов)

	ЗначениеРеквизитаДокумента 	= ЭтотОбъект[РеквизитДокумента.Имя];
	СтрокаТаблицыПараметров 	= ВыборкаРеквизитов.Найти(РеквизитДокумента.Имя);
	
	Если СтрокаТаблицыПараметров = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеРеквизитаДокумента) = Тип("Булево") Тогда
		ДобавитьНовуюСтрокуВТаблицуПараметров(ТаблицаПоПараметрамЗапроса, ЗначениеРеквизитаДокумента, СтрокаТаблицыПараметров, "ЗначениеБулево");	
	ИначеЕсли ТипЗнч(ЗначениеРеквизитаДокумента) = Тип("Число") Тогда
		ДобавитьНовуюСтрокуВТаблицуПараметров(ТаблицаПоПараметрамЗапроса, ЗначениеРеквизитаДокумента, СтрокаТаблицыПараметров, "ЗначениеЧисло");	
	Иначе
		ДобавитьНовуюСтрокуВТаблицуПараметров(ТаблицаПоПараметрамЗапроса, ЗначениеРеквизитаДокумента, СтрокаТаблицыПараметров, "ЗначениеСсылка");
	КонецЕсли;				

КонецПроцедуры

Процедура СформироватьЗаписиПоТабличнымЧастям(ТЧДокумента, ТаблицаПоПараметрамЗапроса, ВыборкаРеквизитов)

	ТабличнаяЧастьДокумента 	= ЭтотОбъект[ТЧДокумента.Имя];
	СтрокаТаблицыПараметров 	= ВыборкаРеквизитов.Найти(ТЧДокумента.Имя);
	
	Если СтрокаТаблицыПараметров = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого РеквизитТабличнойЧасти Из ТЧДокумента.Реквизиты Цикл
	
		СтрокаТаблицыПараметровДляТЧ 	= ВыборкаРеквизитов.Найти(РеквизитТабличнойЧасти.Имя);
		
		Если СтрокаТаблицыПараметровДляТЧ = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		НомерСтроки = 0;
		Для Каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл
			ДобавитьНовуюСтрокуВТаблицуПараметров(ТаблицаПоПараметрамЗапроса, 
													СтрокаТЧ[РеквизитТабличнойЧасти.Имя], 
													СтрокаТаблицыПараметровДляТЧ, 
													"ЗначениеСсылка", 
													НомерСтроки);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;		
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНовуюСтрокуВТаблицуПараметров(ТаблицаПоПараметрамЗапроса, 
													ЗначениеРеквизитаДокумента, 
													СтрокаТаблицыПараметров, 
													ИмяКолонки, 
													НомерСтроки = 0)

	Если СтрокаТаблицыПараметров.ИспользоватьВсегда 
			ИЛИ (?(ТипЗнч(ЗначениеРеквизитаДокумента) = Тип("Булево"), ЗначениеРеквизитаДокумента, Истина) 
					И ЗначениеЗаполнено(ЗначениеРеквизитаДокумента)) Тогда
		
		НоваяСтрокаТЗ 					= ТаблицаПоПараметрамЗапроса.Добавить();
		НоваяСтрокаТЗ.НомерПараметра	= НомерСтроки;
		НоваяСтрокаТЗ.Параметр			= СтрокаТаблицыПараметров.Параметр; 
		НоваяСтрокаТЗ[ИмяКолонки]		= ЗначениеРеквизитаДокумента;
			
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработатьДублированиеЗначенийВТабличныхЧастях()

	ОбработатьДублированиеВТЧ(ФакторыВыбораОН, 	"ФакторВыбора");	
	ОбработатьДублированиеВТЧ(Конкуренты, 		"Конкурент");	
	ОбработатьДублированиеВТЧ(СтопФакторы, 		"СтопФактор");	
	ОбработатьДублированиеВТЧ(Фазы, 			"Фаза");	
	ОбработатьДублированиеВТЧ(ФормыОплаты, 		"ФормаОплаты");	
	ОбработатьДублированиеВТЧ(Расположения,		"Расположение");
	ОбработатьДублированиеВТЧ(Мотивации, 		"Мотивация");
	ОбработатьДублированиеВТЧ(ЦелиПокупки, 		"ЦельПокупки");
	ОбработатьДублированиеВТЧ(Услуги, 			"Услуга");

КонецПроцедуры

//Процедура актуальна только для ТЧ с одной колонкой.
Процедура ОбработатьДублированиеВТЧ(ТабличнаяЧасть, ИмяКолонкиДляПроверки)

	МассивЗначенийДляПроверки = ТабличнаяЧасть.ВыгрузитьКолонку(ИмяКолонкиДляПроверки);	
	ТабличнаяЧасть.Очистить();
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивЗначенийДляПроверки);
	Для каждого ЭлементМассива Из МассивЗначенийДляПроверки Цикл
		НоваяСтрока 						= ТабличнаяЧасть.Добавить();	
		НоваяСтрока[ИмяКолонкиДляПроверки] 	= ЭлементМассива;	
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьДвиженияПоИсторииСтадийСтатусов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеСтатусаСтадииЗапросаСрезПоследних.Стадия КАК Стадия,
	|	ИзменениеСтатусаСтадииЗапросаСрезПоследних.Статус КАК Статус,
	|	ИзменениеСтатусаСтадииЗапросаСрезПоследних.РасшифровкаСтатуса КАК РасшифровкаСтатуса
	|ИЗ
	|	РегистрСведений.ИзменениеСтатусаСтадииЗапроса.СрезПоследних(, Запрос = &Запрос) КАК ИзменениеСтатусаСтадииЗапросаСрезПоследних
	|ГДЕ
	|	(ИзменениеСтатусаСтадииЗапросаСрезПоследних.Стадия <> &Стадия
	|			ИЛИ ИзменениеСтатусаСтадииЗапросаСрезПоследних.Статус <> &Статус
	|			ИЛИ ИзменениеСтатусаСтадииЗапросаСрезПоследних.РасшифровкаСтатуса <> &РасшифровкаСтатуса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзменениеСтатусаСтадииЗапроса.Запрос КАК Запрос
	|ИЗ
	|	РегистрСведений.ИзменениеСтатусаСтадииЗапроса КАК ИзменениеСтатусаСтадииЗапроса
	|ГДЕ
	|	ИзменениеСтатусаСтадииЗапроса.Запрос = &Запрос";
	Запрос.УстановитьПараметр("Запрос", 			Ссылка);
	Запрос.УстановитьПараметр("Стадия", 			Стадия);
	Запрос.УстановитьПараметр("Статус", 			Статус);
	Запрос.УстановитьПараметр("РасшифровкаСтатуса", РасшифровкаСтатуса);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если НЕ РезультатЗапроса[0].Пустой()
			ИЛИ РезультатЗапроса[1].Пустой() Тогда
		
		Период 	= ТекущаяДата();		
		НаборЗаписей = РегистрыСведений.ИзменениеСтатусаСтадииЗапроса.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Отбор.Запрос.Установить(Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Ссылка);
		НоваяЗапись.Период = Период;
		НоваяЗапись.Запрос = Ссылка;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
